{
  "VIEW_GAME": "View Game",
  "START_SPECTATING": "Start Spectating",
  "START_REPLAY": "Join replay",
  "STOP_SPECTATING": "Stop Spectating",
  "JOIN_AS_PLAYER": "Join as Player",
  "LEAVE_GAME": "Leave Game",
  "OPEN_GAME": "Open Game",
  "EDIT_LOBBY_SETTINGS": "Edit Lobby Settings",
  "MANAGE_PLAYERS": "Manage Players",
  "DELETE_LOBBY": "Delete Lobby",
  "START_GAME": "Start Game",
  "READY_UP": "Ready Up",
  "PASSWORD_PROTECTED_LOBBY": "This lobby is password protected, click here to type in password",
  "LOGIN_PAGE": "Login/Registration",
  "PROFILE_PAGE": "Profile",
  "CONTACT_PAGE": "Contact",
  "LOBBIES_PAGE": "Lobbies",
  "GAME_PAGE": "Game",
  "SPECTATE_PAGE": "Spectate",
  "INFORMATION_PAGE": "Helper",
  "CONTACT": "Contact",
  "CONTACT_THE_DEV": "Contact the developer at: h267734@stud.u-szeged.hu",
  "LOGIN": "Login",
  "REGISTRATION": "Register",
  "LOGOUT": "Logout",
  "EMAIL": "Email",
  "PASSWORD": "Password",
  "USERNAME": "Username",
  "FORGOT_PASSWORD": "If you forgot your password fill in the email field and click here",
  "SWITCH_REGISTER_TO_LOGIN": "Click here to get to the login window!",
  "SWITCH_LOGIN_TO_REGISTER": "Click here to get to the registration window!",
  "SETTINGS_MENU": "Settings",
  "LANGUAGE": "Language",
  "ENGLISH": "English",
  "HUNGARIAN": "Hungarian",
  "DARK_MODE": "Dark mode",
  "GAME": "Game",
  "INFORMATION": "Information",
  "OWNER": "Owner",
  "PLAYERS": "Players",
  "SPECTATORS": "Spectators",
  "LOBBY_PRIVATE_NOTIFIER_OWNER": "This lobby is set to private, you can find the invite link after clicking the 'Manage Players' button",
  "LOBBY_PRIVATE_NOTIFIER": "This lobby is private",
  "ENTER_PASSWORD": "Enter the password",
  "SPECTATORS_NOT_ALLOWED": "The lobby doesn't allow spectators",
  "AVAILABLE_LOBBIES": "Available Lobbies",
  "REPLAYS": "Replays",
  "CHANGE_TO_REPLAYS": "Change to replays",
  "Change_TO_LIVE_LOBBIES": "Change to live lobbies",
  "CREATE_NEW_LOBBY": "Create New Lobby",
  "CLOSE": "Close",
  "SELECT_GAME": "Select Game",
  "LOBBY_NAME": "Lobby name",
  "MAX_ROUNDS": "Maximal round number",
  "ALLOW_SPECTATORS": "Allow spectators",
  "PRIVATE_LOBBY": "Private lobby",
  "ENABLE_PASSWORD": "Enable Password",
  "CHANGE_LOBBY_CAPACITY": "Change the lobby capacity",
  "MIN_PLAYERS": "Minimal number of players to start the game",
  "MAX_PLAYERS": "Maximal number of players to start the game",
  "CREATE": "Create",
  "HOUSE": "House game",
  "PIRAMID": "Magical pyramid",
  "RPS": "Rock-paper-scissors",
  "CARDGAME": "Uno",
  "TESTING_GAME": "Test GameName",
  "ID": "ID",
  "INVITE_LINK": "Invite link",
  "BANNED": "Banned",
  "UNBAN": "Unban",
  "YOU": "You",
  "SPECTATING_GAME": "Spectating game",
  "START": "Start",
  "PAUSE": "Pause",
  "JUMP_TO_START": "Jump to the start",
  "GAME_DOESNT_EXIST": "This game doesn't exist or failed to load",
  "SPECTATING_RPS": "Currently spectating rock-paper-scissors",
  "GAMEPLAY": "Gameplay",
  "CHOOSE_ONE": "Choose one",
  "CURRENT_ROUND": "Current round",
  "REAL_ROUND_NUMBER": "Real round number",
  "YOUR_CHOICE": "Your choice",
  "ko": "Rock",
  "papir": "Paper",
  "ollo": "Scissors",
  "NEEDED_WINS": "Needed wins",
  "PREVIOUS_ROUNDS": "Previous rounds",
  "ROUND": "Round",
  "ROUND_WINNER": "Round winner",
  "DRAW": "Draw",
  "GAME_OVER": "Game over",
  "YOU_WON": "You won",
  "YOU_LOST": "You lost",
  "WINNER": "Winner",
  "CHOICE": "'s Choice",
  "NOT_CHOSEN": "Not chosen",
  "CHOOSE": "Choose",
  "JUMP_TO_FIRST_EVENT": "Jump to first event",
  "JUMP_TO_NEXT_EVENT": "Jump to next event",
  "JUMP_TO_REAL_TIME": "Show Real Time",
  "GAME_STARTING_SOON": "The game is starting soon...",
  "UNKNOWN_PLAYER": "Unknown player",
  "EDIT_PROFILE": "Edit Profile",
  "MODIFY_YOUR_PROFILE": "Modify your profile",
  "PROFILE_PICTURE": "Profile picture",
  "CONFIRM_EMAIL": "Confirmation email",
  "CONFIRM_PASSWORD": "Confirmation password",
  "SAVE_CHANGES": "Save changes",
  "DELETE_PROFILE": "Delete profile",
  "EVEN_ROUNDS_WARNING": "You set even rounds for this lobby. This could lead to a drawn game as a result.",
  "LONG_GAME_WARNING": "You set more than 5 rounds. This could lead to a very long game.",
  "WARNINGS_NOTIFIER": "The following problems arose",
  "ARE_YOU_SURE_CREATION": "Are you sure you want to create lobby like this",
  "COOLDOWN_TITLE": "Remaining time",
  "OPPONENT": "Opponent",
  "YOU_WON_ROUND": "You won this round",
  "YOU_LOST_ROUND": "You lost this round",
  "ROUND_DRAWN": "Draw",
  "EMAIL_IN_USE": "This email is already registered",
  "REAUTHENTICATION_REQUIRED": "Please re-login to perform this action",
  "WEAK_PASSWORD": "Password must be at least 6 characters",
  "USER_NOT_FOUND": "User not found",
  "UNKNOWN_ERROR": "An unknown error occurred",
  "FAILED_TO_DELETE_PROFILE": "Failed to delete profile",
  "CANT_DELETE_WHILE_IN_LOBBY": "Cannot delete profile while in a lobby / game",
  "INVALID_USERNAME": "Invalid username",
  "AUTH_FAILED": "Credentials don't match",
  "SELECT_MODIFICATION_TYPE": "Select something you want to change",
  "CURRENT_PASSWORD_CONFIRM": "Confirmation password",
  "SELECT_PROFILE_PICTURE": "Choose a new profile picture",
  "NEW_USERNAME": "New username",
  "NEW_EMAIL": "New email",
  "NEW_PASSWORD": "New password",
  "CHANGES_SAVED": "Changes saved",
  "NETWORK_ERROR": "Network error, or you typed in the wrong password",
  "INVALID_PASSWORD": "Invalid confirmation password",
  "USERNAME_TAKEN": "Username already in use",
  "EMAIL_MISMATCH": "Email and confirmation email doesn't match",
  "SUCCESS": "Success",
  "ERROR": "Error",
  "CONFIRM_DELETE": "Confirm deletion",
  "CANCEL": "Cancel",
  "DELETE": "Delete",
  "CURRENT_EMAIL": "Current email",
  "STATS_PROFILE": "Statistics",
  "OVERALL_STATS": "Overall",
  "OVERALL_STATISTICS": "Statistics overall",
  "TOTAL_GAMES": "Total games",
  "WIN_RATE": "Win rate",
  "TOTAL_WINS": "Victories",
  "TOTAL_LOSSES": "Loses",
  "TOTAL_ROUNDS": "Total round count",
  "AVG_GAME_DURATION": "Average game duration",
  "GAME_RESULT": "Game result",
  "GAME_DURATION": "Game duration",
  "WON_ROUNDS": "Rounds won",
  "LOST_ROUNDS": "Rounds lost",
  "DRAWN_ROUNDS": "Drawn rounds",
  "USERNAME_CONTAINS_ILLEGAL_CHARACTER": "The username contains an illegal character",
  "VICTORY": "Victory",
  "LOSE": "Lose",
  "LAST_ROUND_DIDNT_END": "The last round didn't end for some reason",
  "ROUND_COUNTER": "Current Round",
  "WON_THE_ROUND": "wins the round",
  "SKIP_ANIMATIONS": "Skip animations",
  "REGISTRATION_SUCCESSFUL": "The registration was successful",
  "INVALID_EMAIL": "Invalid email format",
  "INVALID_LOGIN_CREDENTIALS": "The login credentials are wrong",
  "YOU_HAVENT_PLAYED_ANY_GAMES": "You haven't played any games yet so we can't calculate any statistics for you",
  "PLAY_GAME_FOR_STATS": "Finish a match in any of our games to show the statistics",
  "UPDATE": "Update",
  "TOO_MANY_PLAYERS": "The maximal number of players for this game is too high it will be set to the maximal number allowed",
  "TOO_LITTLE_PLAYERS": "The minimal number of players for this game is too low it will be set to the minimal number allowed",
  "TOO_MANY_MIN_PLAYERS": "The minimal number of players is more than the maximal allowed players for the game, it will be set to the maximal number allowed",
  "TOO_LITTLE_MAX_PLAYERS": "The maximal number of players is less than the minimal allowed players for the game, it will be set to the minimal number allowed",
  "PLAYER_NUMBERS_WRONG": "The maximal number of players can't be less then the minimal number of players, those will be set to the same value",
  "WRONG_PASSWORD": "Wrong password",
  "EMAIL_NOT_REGISTERED":"We don't have a user with the provided email, please ensure that you wrote it correctly",
  "REMINDER_EMIL_SENT": "The password reminder email was sent",
  "RESET_PASSWORD_ERROR": "There was an error while resetting your password",
  "BAD_USERNAME": "The username can't contain the '#' character, please remove it",
  "INVALID_NUMBER_OF_USERS_LITTLE": "There are too few players in the lobby to start the game",
  "INVALID_NUMBER_OF_USERS_LOT": "There are too many players in the lobby to start the game",
  "NO_TIME_BAR": "No time bar on the timeline",
  "ADD_BOT": "Add AI player",
  "CANT_CHANGE_WHILE_IN_LOBBY": "Cannot modify the profile while in a lobby / game or when spectating a game",
  "BACK_TO_LOBBY": "Return to lobbies",
  "BACK_TO_REPLAY": "Watch replay of the game",
  "FINAL_RESULT": "Final result",
  "PLAYER_CHOICE": "Your choice",
  "OPPONENT_CHOICE": "Opponent's choice",
  "PLAYER_TIME": "Your choice time",
  "OPPONENT_TIME": "Opponent's choice time",
  "TIME": "Timestamp",
  "PLAYED_ROUNDS_DISTRIBUTION": "Distribution of the rounds played",
  "BACK_TO_GAME": "Return to the game's page",
  "BUTTONS": "Action buttons",
  "PLAY_RANDOM_SOUND": "Play a random sound effect",
  "VOLUME": "Volume",
  "YOU_ARE_BANNED_FROM_LOBBY": "You are banned from this lobby",
  "MAX_PLAYERS_REACHED": "The lobby is full",
  "SEARCHING": "Search...",
  "CHOOSE_A_THEME": "Please choose a theme from the list",
  "FINALISING_ROUND": "Finalising round",
  "GAMETYPE_NOT_IMPLEMENTED": "GameType not implemented",

  "PROFILE_SETTINGS": "Profile Settings",
  "PROFILE_STATISTICS": "Profile Statistics",
  "LOBBIES_PAGE_CREATE_LOBBY": "Lobby Creation/Modification Menu",
  "LOBBIES_PAGE_PLAYER_MANAGE": "Manage Lobby Players",
  "LOBBIES_PAGE_LOBBY": "Lobby",
  "RPS_PAGE": "Rock-Paper-Scissors Game Page",

  "LOGIN_DESCRIPTION": "On this page you will find the login and registration menus, between which you can switch by clicking on the text. If the user provides their email address, a password reminder email can be sent. During registration, it is important to provide an existing email address and the password must be at least 6 characters long, and the username must not contain special characters.",
  "CONTACT_PAGE_DESCRIPTION": "This page contains the developer's contact information.",
  "INFORMATION_PAGE_DESCRIPTION": "On this page you will find detailed descriptions of most of the site's functions and the operation of its various menus.",
  "PROFILE_PAGE_DESCRIPTION": "On this page you can access information and settings related to your profile.",
  "PROFILE_SETTINGS_DESCRIPTION": "In this menu you can change your username, profile picture, and password, as well as their combinations. This requires verification of the relevant data. Additionally, there is an option to delete the profile.",
  "PROFILE_STATISTICS_DESCRIPTION": "In this menu you can view statistics of your previous matches, which may be aggregated per game or detailed per match. Here you can return to the game page or open the game replay page.",
  "LOBBIES_PAGE_DESCRIPTION": "This page displays the lobbies. If you don’t have your own lobby and haven’t joined someone else’s, you can create one using the appropriate button. There is also another button to view lobbies that belong to completed games – these work similarly to live lobbies. Additionally, a search bar for lobbies is provided. If you enter a lobby ID, that lobby will definitely appear even if it is private.",
  "LOBBIES_PAGE_PLAYER_MANAGE_DESCRIPTION": "In this menu you can manage the players in the lobby. The players in the lobby are listed, as well as AI-controlled players. For each human player, buttons are available: you can promote a player to lobby owner using the diamond button, or ban them using the ban icon – in which case the player will be kicked out of the lobby and will not be able to join either as a player or a spectator. An additional lower menu appears where bans can be lifted. A directional arrow button allows you to remove a user from the lobby, although they can rejoin later if they wish. The final icon allows you to change the user’s name; clicking it assigns the user a randomly generated name. If the lobby is not full, you can also add an AI player using the add button. This menu also contains the lobby invitation link: by default it appears blurred, but clicking the blurred text makes it readable; clicking again blurs it, and clicking the adjacent button copies the link. This link allows access to private lobbies when pasted into a browser.",
  "LOBBIES_PAGE_CREATE_LOBBY_DESCRIPTION": "In this menu you can create and modify lobbies. You can only modify a lobby until the associated game has started. Some menu items are marked with a red asterisk – these fields are mandatory for lobby creation. The first step is to select a game from a dropdown menu, followed by providing a lobby name. Next, you set the game duration (for turn-based games, the number of rounds is specified, where the winner must win more than half the rounds plus one). These fields are mandatory. Following this, there are switches: the first lets you set whether others can watch the game; the second sets the lobby to private – in which case only those who enter the lobby ID in the search bar or are already in the lobby can access it. You can then set a password for the lobby; if activated, a password of at least 6 characters is required. If the lobby is password-protected, only those who provide the correct password can interact with the lobby, either as players or spectators. The final option is to modify the lobby capacity: here you can specify the total number of users allowed in the lobby and the minimum number required to start the game. Note that the game settings may override this (for example, 3 players cannot play rock-paper-scissors against each other), and if this setting is active, these values must also be provided – although in some games this option may not be adjustable.",
  "LOBBIES_PAGE_LOBBY_DESCRIPTION": "These lobbies are displayed on the lobbies page. You can create a new lobby using the 'Create Lobby' button, which will be associated with a game. To start a game, the minimum number of players required for that game must be met and the game must be properly configured. Anyone who is not banned can join the lobby. If the lobby is private, only those who enter the lobby ID in the search bar or paste the invitation link into their browser's URL bar can access it. If the lobby is password-protected, only those who provide the password may enter. Once players join, they wait for the lobby owner to start the game, or they have the option to leave, while spectators wait similarly. The lobby owner can manage the players, modify lobby settings, or delete the lobby. When enough players are present and the settings are appropriate, the game can be started; at that point, a countdown begins, and then players, the owner, and spectators are transferred to the game page, after which the game settings become immutable.",
  "SPECTATE_PAGE_DESCRIPTION": "On this page you can watch games. Here you will find a timeline of the game, which displays the events as they occur. During playback, each game has its own replay option. Below the timeline are buttons that allow you to control the timeline. The first button starts a moving pointer along the timeline; if it reaches an event, it passes it to the replay, and if the event is not yet visible, it displays it and shows who did what. The next button stops the pointer, and another button jumps back to the beginning of the game (to the game’s start time). An additional button jumps to the first event (if one exists), followed by a button that jumps to real-time – processing any events until that moment, or if the game has ended, taking you to the final menu. Finally, a button jumps to the next element, and if you skip an element, it is processed. Note that the pointer always jumps to a specific element with a defined time offset.",
  "GAME_PAGE_DESCRIPTION": "This page displays the game, which is the one selected in the lobby. When a game is opened, a 3-second countdown starts while the game is being prepared.",
  "RPS_PAGE_DESCRIPTION": "This page hosts the Rock-Paper-Scissors game. The game is divided into rounds and continues until one player wins. A player wins a round when the number of rounds they have won reaches more than half of the total rounds specified in the lobby plus one. The user can check this either from the counter next to their name or from detailed round statistics. A round is played by both players selecting an option from the images displayed in the center (Rock, Paper, or Scissors). Once both have made their choice, a comparison window appears in front of the two users while a short animation plays. If one choice defeats the other, that player wins the round; if the result is a draw, the round is recorded as a tie, and the game continues.",
  "SETTINGS_MENU_DESCRIPTION": "In this menu you can change the overall settings of the application, such as switching between Hungarian and English, selecting the theme (dark or light), and adjusting the sound effects volume."

}
